<a href="https://colab.research.google.com/github/mygoal-javadeveloper/MyProjects_DA_ML_DL/blob/main/filling_the_numerical_Missing_values_in__Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Name: Nisrin Dhoondia

In [1]:
import numpy as np
import pandas as pd

## Ideally filling the null values should be performed seperately for Train dataset and Test dataset to prevent data leakage.

# Fill NaN with zero  

### Fill NaN with zero column-wise

In [2]:
my_dict = {'fillna_method_zeros_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_zeros_col2' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [3]:
df = pd.DataFrame(my_dict)

In [4]:
df.head(10)

   fillna_method_zeros_col1  fillna_method_zeros_col2
0                       5.0                       5.0
1                      99.0                      99.0
2                       NaN                       NaN
3                      10.0                      10.0
4                      63.0                      63.0
5                      85.0                      85.0
6                       NaN                       NaN
7                     100.0                     100.0
8                       NaN                       NaN
9                       NaN                       NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   fillna_method_zeros_col1  6 non-null      float64
 1   fillna_method_zeros_col2  6 non-null      float64
dtypes: float64(2)
memory usage: 288.0 bytes

In [6]:
df.isnull().sum()

fillna_method_zeros_col1    4
fillna_method_zeros_col2    4
dtype: int64

In [7]:
df['fillna_method_zeros_col1'].fillna(0, inplace = True)
df['fillna_method_zeros_col2'].fillna(0, inplace = True)

In [8]:
df.head(10)

   fillna_method_zeros_col1  fillna_method_zeros_col2
0                       5.0                       5.0
1                      99.0                      99.0
2                       0.0                       0.0
3                      10.0                      10.0
4                      63.0                      63.0
5                      85.0                      85.0
6                       0.0                       0.0
7                     100.0                     100.0
8                       0.0                       0.0
9                       0.0                       0.0

# Fill NaN with zero  

### Fill NaN with zero DataFrame-wise  

fillna() method can be executed on column-wise or entire DataFrame, depending on the requirement to fill the NaN values.

In [9]:
my_dict = {'fillna_method_zeros_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_zeros_col2' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [10]:
df = pd.DataFrame(my_dict)

In [11]:
df.head(10)

   fillna_method_zeros_col1  fillna_method_zeros_col2
0                       5.0                       5.0
1                      99.0                      99.0
2                       NaN                       NaN
3                      10.0                      10.0
4                      63.0                      63.0
5                      85.0                      85.0
6                       NaN                       NaN
7                     100.0                     100.0
8                       NaN                       NaN
9                       NaN                       NaN

In [12]:
df.fillna(0, inplace = True)

In [13]:
df.head(10)

   fillna_method_zeros_col1  fillna_method_zeros_col2
0                       5.0                       5.0
1                      99.0                      99.0
2                       0.0                       0.0
3                      10.0                      10.0
4                      63.0                      63.0
5                      85.0                      85.0
6                       0.0                       0.0
7                     100.0                     100.0
8                       0.0                       0.0
9                       0.0                       0.0

# Fill NaN with mean  

### Fill NaN with mean column-wise

In [14]:
my_dict = {'fillna_method_mean_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_mean_col2' : [10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [15]:
df = pd.DataFrame(my_dict)

In [16]:
df['fillna_method_mean_col1'].fillna(round(df['fillna_method_mean_col1'].mean(), 2), inplace = True)
df['fillna_method_mean_col2'].fillna(round(df['fillna_method_mean_col2'].mean(), 2), inplace = True)

In [17]:
df.head(10)

   fillna_method_mean_col1  fillna_method_mean_col2
0                     5.00                     10.0
1                    99.00                    120.0
2                    60.33                     36.5
3                    10.00                     21.0
4                    63.00                     33.0
5                    85.00                     16.0
6                    60.33                     36.5
7                   100.00                     19.0
8                    60.33                     36.5
9                    60.33                     36.5

# Fill NaN with mean  

### Fill NaN with mean DataFrame-wise

In [18]:
my_dict = {'fillna_method_mean_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_mean_col2' : [10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [19]:
df = pd.DataFrame(my_dict)

In [20]:
df.fillna(df.mean(), inplace = True)

In [21]:
df.head(10)

   fillna_method_mean_col1  fillna_method_mean_col2
0                 5.000000                     10.0
1                99.000000                    120.0
2                60.333333                     36.5
3                10.000000                     21.0
4                63.000000                     33.0
5                85.000000                     16.0
6                60.333333                     36.5
7               100.000000                     19.0
8                60.333333                     36.5
9                60.333333                     36.5

# Fill NaN with mean using lambda

In [22]:
my_dict = {'fillna_method_mean_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_mean_col2' : [10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [23]:
df = pd.DataFrame(my_dict)

In [24]:
df = df.apply(lambda x: x.fillna(round(x.mean(), 2)),axis=0)

In [25]:
df.head(10)

   fillna_method_mean_col1  fillna_method_mean_col2
0                     5.00                     10.0
1                    99.00                    120.0
2                    60.33                     36.5
3                    10.00                     21.0
4                    63.00                     33.0
5                    85.00                     16.0
6                    60.33                     36.5
7                   100.00                     19.0
8                    60.33                     36.5
9                    60.33                     36.5

# Fill NaN with mode

In [26]:
my_dict = {'fillna_method_mode_col1' : [5, 99, np.nan, 21, 63, 85, np.nan, 21, np.nan, np.nan, 5, 21, 5, 99, 21],
           'fillna_method_mode_col2' : [10, 120, np.nan, 21, 33, 10, np.nan, 19, np.nan, np.nan, 13, 120, 10, 120, 10]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [27]:
df = pd.DataFrame(my_dict)

In [28]:
df['fillna_method_mode_col1'].mode() # since the output is a series, we have to retrieve the value using index

0    21.0
dtype: float64

In [29]:
df['fillna_method_mode_col1'].fillna(df['fillna_method_mode_col1'].mode()[0], inplace = True) # since the output is a series, we have to retrieve the value using index
df['fillna_method_mode_col2'].fillna(df['fillna_method_mode_col2'].mode()[0], inplace = True) # since the output is a series, we have to retrieve the value using index

In [30]:
df.head(15)

    fillna_method_mode_col1  fillna_method_mode_col2
0                       5.0                     10.0
1                      99.0                    120.0
2                      21.0                     10.0
3                      21.0                     21.0
4                      63.0                     33.0
5                      85.0                     10.0
6                      21.0                     10.0
7                      21.0                     19.0
8                      21.0                     10.0
9                      21.0                     10.0
10                      5.0                     13.0
11                     21.0                    120.0
12                      5.0                     10.0
13                     99.0                    120.0
14                     21.0                     10.0

# Fill NaN with median  

### Fill NaN with median  

It is performed if your dataset has outliers, and the requirement is to avoid the effect of outliers on other values

In [31]:
my_dict = {'fillna_method_median_col1' : [5, 99, np.nan, 21, 63, 85, np.nan, 21, np.nan, np.nan, 120, 1000],
           'fillna_method_median_col2' : [10, 120, np.nan, 21, 33, 10, np.nan, 19, np.nan, np.nan, 510, 1500]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [32]:
df = pd.DataFrame(my_dict)

In [33]:
df['fillna_method_median_col1'].fillna(df['fillna_method_median_col1'].median(), inplace = True)
df['fillna_method_median_col2'].fillna(df['fillna_method_median_col2'].median(), inplace = True)

In [34]:
# it can be performed DataFrame-wise too
# df.fillna(df.median(), inplace = True)

In [35]:
df.head(12)

    fillna_method_median_col1  fillna_method_median_col2
0                         5.0                       10.0
1                        99.0                      120.0
2                        74.0                       27.0
3                        21.0                       21.0
4                        63.0                       33.0
5                        85.0                       10.0
6                        74.0                       27.0
7                        21.0                       19.0
8                        74.0                       27.0
9                        74.0                       27.0
10                      120.0                      510.0
11                     1000.0                     1500.0

# Fill NaN with forward fill

In [36]:
my_dict = {'fillna_method_forwardfill_col1' : [np.nan, np.nan, 5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_forwardfill_col2' : [np.nan, 4, 10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [37]:
df = pd.DataFrame(my_dict)

In [38]:
df['fillna_method_forwardfill_col1'].fillna(method ='ffill', inplace = True)
df['fillna_method_forwardfill_col2'].fillna(method ='ffill', inplace = True)

In [39]:
# it can be performed DataFrame-wise too
# df.fillna(method ='ffill', inplace = True)

In [40]:
# instead of ffill, pad can also be given 
# it can be performed DataFrame-wise too 
# df['fillna_method_forwardfill_col1'].fillna(method ='pad', inplace = True)
# df['fillna_method_forwardfill_col2'].fillna(method ='pad', inplace = True)

In [41]:
df.head(12)

    fillna_method_forwardfill_col1  fillna_method_forwardfill_col2
0                              NaN                             NaN
1                              NaN                             4.0
2                              5.0                            10.0
3                             99.0                           120.0
4                             99.0                           120.0
5                             10.0                            21.0
6                             63.0                            33.0
7                             85.0                            16.0
8                             85.0                            16.0
9                            100.0                            19.0
10                           100.0                            19.0
11                           100.0                            19.0

# Fill NaN with backward fill

In [42]:
my_dict = {'fillna_method_bfill_col1' : [np.nan, np.nan, 5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'fillna_method_backwardfill_col2' : [np.nan, 4, 10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [43]:
df = pd.DataFrame(my_dict)

In [44]:
# instead of bfill, backfill can also be given 
# it can be performed DataFrame-wise too 
df['fillna_method_bfill_col1'].fillna(method ='bfill', inplace = True)
df['fillna_method_backwardfill_col2'].fillna(method ='backfill', inplace = True)

In [45]:
df.head(12)

    fillna_method_bfill_col1  fillna_method_backwardfill_col2
0                        5.0                              4.0
1                        5.0                              4.0
2                        5.0                             10.0
3                       99.0                            120.0
4                       10.0                             21.0
5                       10.0                             21.0
6                       63.0                             33.0
7                       85.0                             16.0
8                      100.0                             19.0
9                      100.0                             19.0
10                       NaN                              NaN
11                       NaN                              NaN

# Fill NaN with specific values

In [46]:
my_dict = {'col1' : [np.nan, np.nan, 5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'col2' : [np.nan, 4, 10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [47]:
df = pd.DataFrame(my_dict)

In [48]:
values = {'col1': 12, 'col2': 15}

In [49]:
df.fillna(value=values, inplace = True)

In [50]:
df.head(12)

     col1   col2
0    12.0   15.0
1    12.0    4.0
2     5.0   10.0
3    99.0  120.0
4    12.0   15.0
5    10.0   21.0
6    63.0   33.0
7    85.0   16.0
8    12.0   15.0
9   100.0   19.0
10   12.0   15.0
11   12.0   15.0

# Fill NaN with specific values using replace

In [51]:
my_dict = {'col1' : [np.nan, np.nan, 5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'col2' : [np.nan, 4, 10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [52]:
df = pd.DataFrame(my_dict)

In [53]:
# DataFrame-wise with only one specific value for all columns
# df.replace(np.nan, 12, inplace = True)

In [54]:
df['col1'].replace(np.nan, 12, inplace = True) 
df['col2'].replace(np.nan, 15, inplace = True)

In [55]:
df.head(12)

     col1   col2
0    12.0   15.0
1    12.0    4.0
2     5.0   10.0
3    99.0  120.0
4    12.0   15.0
5    10.0   21.0
6    63.0   33.0
7    85.0   16.0
8    12.0   15.0
9   100.0   19.0
10   12.0   15.0
11   12.0   15.0

# Fill NaN with interpolate

In [56]:
my_dict = {'interpolate_col1' : [np.nan, np.nan, 5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'interpolate_col2' : [np.nan, 4, 10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [57]:
df = pd.DataFrame(my_dict)

In [58]:
df.interpolate(method ='linear', limit_direction ='forward', inplace = True)

In [59]:
df.head(12)

    interpolate_col1  interpolate_col2
0                NaN               NaN
1                NaN               4.0
2                5.0              10.0
3               99.0             120.0
4               54.5              70.5
5               10.0              21.0
6               63.0              33.0
7               85.0              16.0
8               92.5              17.5
9              100.0              19.0
10             100.0              19.0
11             100.0              19.0

# Fill NaN using SimpleImputer

In [60]:
my_dict = {'simpleimputer_col1' : [5, 99, np.nan, 10, 63, 85, np.nan, 100, np.nan, np.nan],
           'simpleimputer_col2' : [10, 120, np.nan, 21, 33, 16, np.nan, 19, np.nan, np.nan]} 
# when there is NaN values the entire column dtypes changes from int to float dtype

In [61]:
df = pd.DataFrame(my_dict)

In [62]:
from sklearn.impute import SimpleImputer

impute = SimpleImputer(missing_values=np.nan, strategy='mean')
for cols in ['simpleimputer_col1', 'simpleimputer_col2']:
    df[cols] = impute.fit_transform(df[[cols]])

In [63]:
df.head(10)

   simpleimputer_col1  simpleimputer_col2
0            5.000000                10.0
1           99.000000               120.0
2           60.333333                36.5
3           10.000000                21.0
4           63.000000                33.0
5           85.000000                16.0
6           60.333333                36.5
7          100.000000                19.0
8           60.333333                36.5
9           60.333333                36.5